In [3]:
import pandas as pd

In [260]:
df = pd.read_csv('netflix_titles.csv')

In [6]:
df.head() #

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",NaN,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,NaN,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...

In [7]:
df.isnull().sum()

show_id            0
type               0
title              0
director        2634
cast             825
country          831
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64

In [13]:
df.dropna(inplace = True)

In [17]:
df.isnull().sum()

show_id         0
type            0
title           0
director        0
cast            0
country         0
date_added      0
release_year    0
rating          0
duration        0
listed_in       0
description     0
dtype: int64

In [40]:
def change(data):
    return data['show_id'] + '_010101'

In [42]:
df.apply(change, axis = 1)

7          s8_010101
8          s9_010101
9         s10_010101
12        s13_010101
24        s25_010101
            ...
8801    s8802_010101
8802    s8803_010101
8804    s8805_010101
8805    s8806_010101
8806    s8807_010101
Length: 5332, dtype: object

In [44]:
 A = df['show_id']

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB

In [17]:
df['release_year'].dtype

dtype('int64')

In [21]:
df['DataTime'] = pd.to_datetime(df['release_year'])

In [23]:
df.head(2)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description,DataTime
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm...",1970-01-01 00:00:00.000002020
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t...",1970-01-01 00:00:00.000002021

In [33]:
df['DataTime'].dt.month

0       1
1       1
2       1
3       1
4       1
       ..
8802    1
8803    1
8804    1
8805    1
8806    1
Name: DataTime, Length: 8807, dtype: int32

In [39]:
df2 = pd.read_csv('weather_by_cities.csv')

In [41]:
df2.head()

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
4  1/1/2017    mumbai           90          5  Sunny

In [43]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          12 non-null     object
 1   city         12 non-null     object
 2   temperature  12 non-null     int64
 3   windspeed    12 non-null     int64
 4   event        12 non-null     object
dtypes: int64(2), object(3)
memory usage: 612.0+ bytes

In [47]:
df2['day'].unique()

array(['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017'], dtype=object)

In [119]:
df2['day'] = pd.to_datetime(df2['day'])

In [121]:
df2.head()

         day      city  temperature  windspeed  event    NewDate
0 2017-01-01  new york           32          6   Rain 2017-01-01
1 2017-01-02  new york           36          7  Sunny 2017-01-02
2 2017-01-03  new york           28         12   Snow 2017-01-03
3 2017-01-04  new york           33          7  Sunny 2017-01-04
4 2017-01-01    mumbai           90          5  Sunny 2017-01-01

In [117]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          12 non-null     object
 1   city         12 non-null     object
 2   temperature  12 non-null     int64
 3   windspeed    12 non-null     int64
 4   event        12 non-null     object
 5   NewDate      12 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 708.0+ bytes

In [99]:
df2['NewDate'].dt.year

0     2017
1     2017
2     2017
3     2017
4     2017
5     2017
6     2017
7     2017
8     2017
9     2017
10    2017
11    2017
Name: NewDate, dtype: int32

In [78]:
list2 = []

for x in list1:
    list2.append(x)

In [86]:
df2.loc[list2]

        day      city  temperature  windspeed  event    NewDate
1  1/2/2017  new york           36          7  Sunny 2017-01-02
2  1/3/2017  new york           28         12   Snow 2017-01-03
3  1/4/2017  new york           33          7  Sunny 2017-01-04
4  1/1/2017    mumbai           90          5  Sunny 2017-01-01
1  1/2/2017  new york           36          7  Sunny 2017-01-02
2  1/3/2017  new york           28         12   Snow 2017-01-03
3  1/4/2017  new york           33          7  Sunny 2017-01-04
4  1/1/2017    mumbai           90          5  Sunny 2017-01-01
1  1/2/2017  new york           36          7  Sunny 2017-01-02
2  1/3/2017  new york           28         12   Snow 2017-01-03
3  1/4/2017  new york           33          7  Sunny 2017-01-04
4  1/1/2017    mumbai           90          5  Sunny 2017-01-01

In [103]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   day          12 non-null     object
 1   city         12 non-null     object
 2   temperature  12 non-null     int64
 3   windspeed    12 non-null     int64
 4   event        12 non-null     object
 5   NewDate      12 non-null     datetime64[ns]
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 708.0+ bytes

In [113]:
df2['NewDate'].dt.year == 2017

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
10    True
11    True
Name: NewDate, dtype: bool

In [ ]:
# # for i = 0; i < 10; i++{
# for j = 0; j<i; j++{\
# 0
# array[]\
# }
# }

In [140]:
df['Year'] = df['DataTime'].dt.year

In [152]:
df.sort_values(by='title')

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description,DataTime,Year
2036,s2037,Movie,#Alive,Cho Il,"Yoo Ah-in, Park Shin-hye",South Korea,"September 8, 2020",2020,TV-MA,99 min,"Horror Movies, International Movies, Thrillers","As a grisly virus rampages a city, a lone man ...",1970-01-01 00:00:00.000002020,1970
2304,s2305,Movie,#AnneFrank - Parallel Stories,"Sabina Fedeli, Anna Migotto","Helen Mirren, Gengher Gatti",Italy,"July 1, 2020",2019,TV-14,95 min,"Documentaries, International Movies","Through her diary, Anne Frank's story is retol...",1970-01-01 00:00:00.000002019,1970
2481,s2482,Movie,#FriendButMarried,Rako Prijanto,"Adipati Dolken, Vanesha Prescilla, Rendi Jhon,...",Indonesia,"May 21, 2020",2018,TV-G,102 min,"Dramas, International Movies, Romantic Movies","Pining for his high school crush for years, a ...",1970-01-01 00:00:00.000002018,1970
2324,s2325,Movie,#FriendButMarried 2,Rako Prijanto,"Adipati Dolken, Mawar de Jongh, Sari Nila, Von...",Indonesia,"June 28, 2020",2020,TV-G,104 min,"Dramas, International Movies, Romantic Movies",As Ayu and Ditto finally transition from best ...,1970-01-01 00:00:00.000002020,1970
5973,s5974,Movie,#Roxy,Michael Kennedy,"Jake Short, Sarah Fisher, Booboo Stewart, Dann...",Canada,"April 10, 2019",2018,TV-14,105 min,"Comedies, Romantic Movies",A teenage hacker with a huge nose helps a cool...,1970-01-01 00:00:00.000002018,1970
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6177,s6178,TV Show,忍者ハットリくん,NaN,NaN,Japan,"December 23, 2018",2012,TV-Y7,2 Seasons,"Anime Series, Kids' TV","Hailing from the mountains of Iga, Kanzo Hatto...",1970-01-01 00:00:00.000002012,1970
4914,s4915,TV Show,海的儿子,NaN,"Li Nanxing, Christopher Lee, Jesseca Liu, Appl...",NaN,"April 27, 2018",2016,TV-14,1 Season,"International TV Shows, TV Dramas","Two brothers start a new life in Singapore, wh...",1970-01-01 00:00:00.000002016,1970
7101,s7102,TV Show,마녀사냥,NaN,"Si-kyung Sung, Se-yoon Yoo, Dong-yup Shin, Ji-...",South Korea,"February 19, 2018",2015,TV-MA,1 Season,"International TV Shows, Korean TV Shows, Stand...",Four Korean celebrity men and guest stars of b...,1970-01-01 00:00:00.000002015,1970
5022,s5023,Movie,반드시 잡는다,Hong-seon Kim,Baek Yoon-sik,South Korea,"February 28, 2018",2017,TV-MA,110 min,"Dramas, International Movies, Thrillers",After people in his town start turning up dead...,1970-01-01 00:00:00.000002017,1970
7108,s7109,Movie,최강전사 미니특공대 : 영웅의 탄생,Young Jun Lee,"Um Sang-hyun, Yang Jeong-hwa, Jeon Tae-yeol, S...",NaN,"September 1, 2018",2018,TV-Y7,68 min,Children & Family Movies,"Miniforce, a special task force of elite range...",1970-01-01 00:00:00.000002018,1970

In [148]:
# Sorting for loop / while loop

In [266]:
df = pd.read_csv('data_science_job.csv')

In [240]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,36.0,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5.0,NaN,NaN,83.0,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,0.0,NaN,Pvt Ltd,52.0,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0.0

In [242]:
df.isnull().sum()

enrollee_id                  0
city                         0
city_development_index     479
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
training_hours             766
target                       0
dtype: int64

In [243]:
df.dropna(inplace = True)

In [245]:
df.shape

(8434, 13)

In [170]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8434 entries, 1 to 19155
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             8434 non-null   int64
 1   city                    8434 non-null   object
 2   city_development_index  8434 non-null   float64
 3   gender                  8434 non-null   object
 4   relevent_experience     8434 non-null   object
 5   enrolled_university     8434 non-null   object
 6   education_level         8434 non-null   object
 7   major_discipline        8434 non-null   object
 8   experience              8434 non-null   float64
 9   company_size            8434 non-null   object
 10  company_type            8434 non-null   object
 11  training_hours          8434 non-null   float64
 12  target                  8434 non-null   float64
dtypes: float64(4), int64(1), object(8)
memory usage: 922.5+ KB

In [176]:
df['training_hours'].min()

1.0

In [178]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0.0
7,402,city_46,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,13.0,<10,Pvt Ltd,18.0,1.0
8,27107,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,7.0,50-99,Pvt Ltd,46.0,1.0
11,23853,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,5.0,5000-9999,Pvt Ltd,108.0,0.0

In [180]:
df['gender'].value_counts()

gender
Male      7597
Female     763
Other       74
Name: count, dtype: int64

In [182]:
df['experience'].mean()

11.433246383685084

In [184]:

data = {
    'Department': ['Sales', 'Sales', 'HR', 'HR', 'IT', 'IT'],
    'Salary': [50000, 55000, 60000, 58000, 75000, 72000]
}

In [186]:
df = pd.DataFrame(data)

In [196]:
df

  Department  Salary
0      Sales   50000
1      Sales   55000
2         HR   60000
3         HR   58000
4         IT   75000
5         IT   72000

In [224]:
import matplotlib.pyplot as plt

In [236]:
df.groupby('Department').sum()

            Salary
Department
HR          118000
IT          147000
Sales       105000

In [258]:
df.groupby('gender')['target'].sum()

gender
Female     128.0
Male      1254.0
Other       12.0
Name: target, dtype: float64

In [268]:
df['gender'].value_counts()

gender
Male      13221
Female     1238
Other       191
Name: count, dtype: int64

In [274]:
df.isnull().sum()

enrollee_id                  0
city                         0
city_development_index     479
gender                    4508
relevent_experience          0
enrolled_university        386
education_level            460
major_discipline          2813
experience                  65
company_size              5938
company_type              6140
training_hours             766
target                       0
dtype: int64

In [276]:
df.dropna(inplace = True)

In [278]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0.0
7,402,city_46,0.762,Male,Has relevent experience,no_enrollment,Graduate,STEM,13.0,<10,Pvt Ltd,18.0,1.0
8,27107,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,7.0,50-99,Pvt Ltd,46.0,1.0
11,23853,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,5.0,5000-9999,Pvt Ltd,108.0,0.0

In [292]:
df.groupby('gender')['experience'].mean()

gender
Female     9.715596
Male      11.607345
Other     11.270270
Name: experience, dtype: float64

In [294]:
df['education_level'].unique()

array(['Graduate', 'Masters', 'Phd'], dtype=object)

In [296]:
# G = high
# M =  Medium
# P = small

In [327]:
newdf = df.groupby('education_level')[['experience','city_development_index']].min()

In [343]:
newdf.reset_index()

  education_level  experience  city_development_index
0        Graduate         0.0                   0.448
1         Masters         0.0                   0.479
2             Phd         0.0                   0.624

In [ ]:
# SamTec

In [ ]:
# iphone - I, apple (F) -UK , book - P  # country